Repository: ESUCC/Maximd
Catalog: application/translation/form002/page4.tmx
Source language: es
Languages: en

source: Los alumnos que asisten a escuelas que no son públicas, deben tener a un miembro administrativo o representante designado de dicha escuela como miembro del MDT
en: For students attending non-public schools, an administrator or a designated representative of the non-public school shall be a member of the MDT

source: Si un(os) miembro(s) del MDT no están de acuerdo con la(s) conclusión(es) de este informe, debe(n) entregar una declaración por separado (informe minoritario) en el cual se presenten su(s) conclusión(es)
en: Should a member(s) of the MDT not agree with the conclusion(s) of the report, they must submit a separate statement (minority report) presenting his or her conclusion(s)

source: Fecha provista
en: Date Provided

source: El padre de familia recibió una copia del informe del equipo sobre la evaluación multidisciplinaria el
en: The parent was provided a copy of the multidisciplinary evaluation team report on:

source: Por:
en: By:

source: (nombre)
en: (name)

source: Sí
en: Yes

source: Imprimir renglones en blanco
en: Print blank rows

source: Nombre
en: Name

source: Posición en el MDT
en: Position on MDT

source: Estoy de acuerdo con la decisión del MDT
en: I agree with the MDT decision

source: Quitar el renglón
en: Remove Row

source: SPANISH: MDT has been provided at no cost
en: MDT has been provided at no cost
